app/controllers/movies_controller.rb

    end

    if @ratings and @sort
      @movies = Movie.where(:rating => @ratings.keys).find(:all, :order => (@sort))
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG') ORDER BY release_date

    elsif @sort
      @movies = Movie.find(:all, :order => (@sort))
    else
      @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY release_date